balabas11111/SmartHouse/projects/ESP8266NtpPir/sloeber.ino.cpp
#ifdef __IN_ECLIPSE__
//This is a automatic generated file
//Please do not modify this file
//If you touch this file your change will be overwritten during the next build
//This file has been generated on 2018-12-22 06:16:27

#include "Arduino.h"
#include "Arduino.h"
#include <Hash.h>
#include <ESP8266WiFi.h>
#include "EspSettingsBox.h"
#include "Loopable.h"
#include "FS.h"
#include "I2Chelper.h"
#include "WiFiHelper.h"
#include <Wire.h>
#include "NtpTimeClientService.h"
#include <ESP8266WebServer.h>
#include <ESP8266HTTPUpdateServer.h>
#include "TimeTrigger.h"
#include <DeviceHelper.h>
#include <DisplayHelperAbstract.h>
#include <ThingSpeakHelper.h>
#include <PinDigital.h>
#include <Pir_Sensor.h>
#include <BeeperB.h>
#include "DS18D20_Sensor.h"
#include "BME280_Sensor.h"
#include "StatusMessage.h"
#include "TM1637.h"

void setup() ;
void loop() ;
void displayLoad();
void initDisplayMode();
void displayTime();
void displayTemperatureBme(boolean fromButton);
void displayHumidityBme(boolean fromButton);
void displayPressureBme(boolean fromButton);
void displayTemperatureDS18D20(boolean fromButton);
void displayDisplayModeInfo(int modeDescriptor,uint8_t delay1,uint16_t delay2,boolean fromButton);
void displayIntStringValue(String str,int modeDescriptor);
void clearDisplay(uint8_t delayTime);
void refreshDisplayPage(boolean fromButton);
void refreshDisplay();
void selectCurrentDS18D20();
void changePage();
void onButtonMenuChanged();
void processTimeClientEvent(int8_t* time);
void postInitWebServer();
void measureSensors();
void onPirDetectorChanged();
void loadSensors();
void saveSensors();
String setSensorJson();
String getAllSensorsJson();
String executeCommand();
void executePostPonedCommand();
String setEspSettingsBoxValues();
void processThingSpeakPost();
void sendAbstractItemToHttp(AbstractItem* item);

#include "ESP8266_Ntp_Pir.ino"


#endif
